Revit 2027 API
FamilyItemFactory.NewRadialDimension(View, Reference, XYZ) Method
 Creates a new radial dimension object using the default dimension type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Dimension NewRadialDimension(
	View view,
	Reference arcRef,
	XYZ origin
)
Public Function NewRadialDimension (
	view As View,
	arcRef As Reference,
	origin As XYZ
) As Dimension
public:
Dimension^ NewRadialDimension(
	View^ view,
	Reference^ arcRef,
	XYZ^ origin
)
member NewRadialDimension :
        view : View *
        arcRef : Reference *
        origin : XYZ -> Dimension
Parameters
view View
 The view in which the dimension is to be visible.
arcRef Reference
 Geometric reference of the arc to which the dimension is to be bound.
origin XYZ
 The point where the witness line of the radial dimension will lie.
Return Value
Dimension
If creation was successful the new arc length dimension is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when any input argument is null.
ArgumentException |  Thrown when the argument arcRef is invalid.
InvalidOperationException |  Thrown when the creation failed.
Remarks
 The currently user set default style is used for the created dimension.
See Also
Reference
FamilyItemFactory Class
NewRadialDimension Overload
Autodesk.Revit.Creation Namespace